{"id":"5c465377-245c-411b-8398-b4c27ed7c281","updated_at":"2024-11-19T12:56:43.224Z","updated_by":"elastic","created_at":"2024-11-19T12:52:12.530Z","created_by":"elastic","name":"A06_T1190_java-attack","tags":[],"interval":"5m","enabled":true,"revision":0,"description":"T1190_java-attack","risk_score":21,"severity":"low","license":"","output_index":"","meta":{"from":"1m","kibana_siem_app_url":"http://localhost:5601/app/security"},"author":[],"false_positives":[],"from":"now-360s","rule_id":"06fd077d-0a8c-465b-bc90-e8f99f507345","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"threshold","language":"kuery","data_view_id":"security-solution-default","query":"","filters":[{"$state":{"store":"appState"},"meta":{"type":"combined","relation":"AND","params":[{"query":{"match_phrase":{"http_user_agent":"Java/1.8.0_181"}},"meta":{"negate":false,"index":"security-solution-default","key":"http_user_agent","field":"http_user_agent","params":{"query":"Java/1.8.0_181"},"type":"phrase","disabled":false,"alias":null}},{"meta":{"negate":false,"index":"security-solution-default","key":"http_method","field":"http_method","params":{"query":"GET"},"type":"phrase","disabled":false,"alias":null},"query":{"match_phrase":{"http_method":"GET"}}}],"index":"security-solution-default","disabled":false,"negate":false,"alias":null},"query":{}}],"threshold":{"field":["src_ip","status","dest_ip"],"value":3,"cardinality":[{"field":"uri","value":1}]},"actions":[]}
{"exported_count":1,"exported_rules_count":1,"missing_rules":[],"missing_rules_count":0,"exported_exception_list_count":0,"exported_exception_list_item_count":0,"missing_exception_list_item_count":0,"missing_exception_list_items":[],"missing_exception_lists":[],"missing_exception_lists_count":0,"exported_action_connector_count":0,"missing_action_connection_count":0,"missing_action_connections":[],"excluded_action_connection_count":0,"excluded_action_connections":[]}
