{"id":"69145f99-2315-4d6e-99a7-e1c6e706f880","updated_at":"2024-11-21T10:13:30.954Z","updated_by":"elastic","created_at":"2024-11-21T10:13:30.954Z","created_by":"elastic","name":"A01:2021 Detection Rule aws_updateloginprofile","tags":[],"interval":"5m","enabled":true,"revision":0,"description":"A01:2021 Detection Rule aws_updateloginprofile","risk_score":21,"severity":"low","license":"","output_index":"","meta":{"from":"1m","kibana_siem_app_url":"http://localhost:5601/app/security"},"author":[],"false_positives":[],"from":"now-360s","rule_id":"a191926d-a040-4eaa-b2f8-53cb8cb4fb0a","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","data_view_id":"security-solution-default","query":"","filters":[{"meta":{"index":"security-solution-default","type":"custom","disabled":false,"negate":false,"alias":null,"key":"query","value":"{\"bool\":{\"must\":[],\"filter\":[{\"match_phrase\":{\"updateloginprofile.eventName\":\"UpdateLoginProfile\"}}],\"should\":[{\"wildcard\":{\"updateloginprofile.userAgent\":\"aws-cli\"}}],\"must_not\":[]}}"},"$state":{"store":"appState"},"query":{"bool":{"must":[],"filter":[{"match_phrase":{"updateloginprofile.eventName":"UpdateLoginProfile"}}],"should":[{"wildcard":{"updateloginprofile.userAgent":"aws-cli"}}],"must_not":[]}}}],"actions":[]}
{"exported_count":1,"exported_rules_count":1,"missing_rules":[],"missing_rules_count":0,"exported_exception_list_count":0,"exported_exception_list_item_count":0,"missing_exception_list_item_count":0,"missing_exception_list_items":[],"missing_exception_lists":[],"missing_exception_lists_count":0,"exported_action_connector_count":0,"missing_action_connection_count":0,"missing_action_connections":[],"excluded_action_connection_count":0,"excluded_action_connections":[]}
