{"id":"aade692b-8f22-4a02-af15-02d3e0b5abdc","updated_at":"2024-11-19T17:04:12.339Z","updated_by":"elastic","created_at":"2024-11-19T16:43:59.052Z","created_by":"elastic","name":"A05-Security Misconfiguration-T1190-Atomic-red-team","tags":[],"interval":"5m","enabled":true,"revision":1,"description":"T1190-Atomic-red-team","risk_score":21,"severity":"low","license":"","output_index":"","meta":{"from":"1m","kibana_siem_app_url":"http://localhost:5601/app/security"},"author":[],"false_positives":[],"from":"now-360s","rule_id":"f2a23ea8-9984-4c29-ac54-a0c846de5eda","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","data_view_id":"security-solution-default","query":"","filters":[{"meta":{"type":"combined","relation":"AND","params":[{"query":{"match_phrase":{"A05.http_method":"POST"}},"meta":{"negate":false,"index":"security-solution-default","key":"A05.http_method","field":"A05.http_method","params":{"query":"POST"},"type":"phrase","disabled":false,"alias":null}},{"meta":{"negate":false,"index":"security-solution-default","key":"A05.status","field":"A05.status","params":{"query":"200"},"type":"phrase","disabled":false,"alias":null},"query":{"match_phrase":{"A05.status":"200"}}},{"meta":{"disabled":false,"negate":false,"alias":null,"index":"security-solution-default","key":"A05.dest_port","field":"A05.dest_port","params":{"query":"443"},"type":"phrase"},"$state":{"store":"appState"},"query":{"match_phrase":{"A05.dest_port":"443"}}},{"query":{"exists":{"field":"A05.request_body.element.settings.query.queryEditor"}},"meta":{"negate":false,"index":"security-solution-default","key":"A05.request_body.element.settings.query.queryEditor","field":"A05.request_body.element.settings.query.queryEditor","value":"exists","type":"exists","disabled":false,"alias":null}}],"index":"security-solution-default","disabled":false,"negate":false,"alias":null},"query":{},"$state":{"store":"appState"}},{"meta":{"index":"security-solution-default","type":"custom","disabled":false,"negate":false,"alias":null,"key":"query","value":"{\"bool\":{\"should\":[{\"wildcard\":{\"A05.request_body.element.settings.query.queryEditor\":\"*whoami*\"}},{\"wildcard\":{\"A05.request_body.element.settings.query.queryEditor\":\"*Exception*\"}},{\"wildcard\":{\"A05.request_body.element.settings.query.queryEditor\":\"*system*\"}},{\"wildcard\":{\"A05.request_body.element.settings.query.queryEditor\":\"*exec*\"}},{\"wildcard\":{\"A05.request_body.element.settings.query.queryEditor\":\"*command*\"}},{\"wildcard\":{\"A05.request_body.element.settings.query.queryEditor\":\"*eval*\"}},{\"wildcard\":{\"A05.request_body.element.settings.query.queryEditor\":\"*shell*\"}},{\"wildcard\":{\"A05.request_body.element.settings.query.queryEditor\":\"*phpinfo*\"}},{\"wildcard\":{\"A05.request_body.element.settings.query.queryEditor\":\"*powershell*\"}},{\"wildcard\":{\"A05.request_body.element.settings.query.queryEditor\":\"*throw new Exception*\"}}]}}"},"query":{"bool":{"should":[{"wildcard":{"A05.request_body.element.settings.query.queryEditor":"*whoami*"}},{"wildcard":{"A05.request_body.element.settings.query.queryEditor":"*Exception*"}},{"wildcard":{"A05.request_body.element.settings.query.queryEditor":"*system*"}},{"wildcard":{"A05.request_body.element.settings.query.queryEditor":"*exec*"}},{"wildcard":{"A05.request_body.element.settings.query.queryEditor":"*command*"}},{"wildcard":{"A05.request_body.element.settings.query.queryEditor":"*eval*"}},{"wildcard":{"A05.request_body.element.settings.query.queryEditor":"*shell*"}},{"wildcard":{"A05.request_body.element.settings.query.queryEditor":"*phpinfo*"}},{"wildcard":{"A05.request_body.element.settings.query.queryEditor":"*powershell*"}},{"wildcard":{"A05.request_body.element.settings.query.queryEditor":"*throw new Exception*"}}]}},"$state":{"store":"appState"}}],"actions":[]}
{"exported_count":1,"exported_rules_count":1,"missing_rules":[],"missing_rules_count":0,"exported_exception_list_count":0,"exported_exception_list_item_count":0,"missing_exception_list_item_count":0,"missing_exception_list_items":[],"missing_exception_lists":[],"missing_exception_lists_count":0,"exported_action_connector_count":0,"missing_action_connection_count":0,"missing_action_connections":[],"excluded_action_connection_count":0,"excluded_action_connections":[]}
