{"id":"38e01a56-84fc-4263-87a9-b1ac439f0cc4","updated_at":"2024-11-19T16:11:42.273Z","updated_by":"elastic","created_at":"2024-11-19T14:10:58.056Z","created_by":"elastic","name":"A10:2021 T1071.001 Detection Rule","tags":[],"interval":"5m","enabled":true,"revision":1,"description":"A10:2021 T1071.001 Detection Rule","risk_score":21,"severity":"low","license":"","output_index":"","meta":{"from":"1m","kibana_siem_app_url":"http://localhost:5601/app/security"},"author":[],"false_positives":[],"from":"now-360s","rule_id":"51f0bfb4-9d68-4970-b8a7-1af5d46e1429","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0011","name":"Command and Control","reference":"https://attack.mitre.org/tactics/TA0011"},"technique":[{"id":"T1071","name":"Application Layer Protocol","reference":"https://attack.mitre.org/techniques/T1071","subtechnique":[{"id":"T1071.001","name":"Web Protocols","reference":"https://attack.mitre.org/techniques/T1071/001"}]}]}],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","data_view_id":"security-solution-default","query":"","filters":[{"meta":{"index":"security-solution-default","type":"custom","disabled":false,"negate":false,"alias":null,"key":"query","value":"{\"bool\":{\"should\":[{\"wildcard\":{\"A10.http.request.url\":{\"value\":\"http://127.0.0.1*\"}}},{\"wildcard\":{\"A10.http.request.url\":{\"value\":\"http://169.254.169.254*\"}}},{\"wildcard\":{\"A10.http.request.url\":{\"value\":\"http://0.0.0.0*\"}}},{\"wildcard\":{\"A10.http.request.url\":{\"value\":\"http://localhost*\"}}},{\"wildcard\":{\"A10.http.request.url\":{\"value\":\"http://*.onion*\"}}}]}}"},"$state":{"store":"appState"},"query":{"bool":{"should":[{"wildcard":{"A10.http.request.url":{"value":"http://127.0.0.1*"}}},{"wildcard":{"A10.http.request.url":{"value":"http://169.254.169.254*"}}},{"wildcard":{"A10.http.request.url":{"value":"http://0.0.0.0*"}}},{"wildcard":{"A10.http.request.url":{"value":"http://localhost*"}}},{"wildcard":{"A10.http.request.url":{"value":"http://*.onion*"}}}]}}}],"actions":[]}
{"exported_count":1,"exported_rules_count":1,"missing_rules":[],"missing_rules_count":0,"exported_exception_list_count":0,"exported_exception_list_item_count":0,"missing_exception_list_item_count":0,"missing_exception_list_items":[],"missing_exception_lists":[],"missing_exception_lists_count":0,"exported_action_connector_count":0,"missing_action_connection_count":0,"missing_action_connections":[],"excluded_action_connection_count":0,"excluded_action_connections":[]}
