{"id":"c9ce9f42-4f14-460d-8130-f844f70c76ac","updated_at":"2024-11-19T11:18:38.144Z","updated_by":"elastic","created_at":"2024-11-19T10:32:26.853Z","created_by":"elastic","name":"A04-T1078-attach-role-trust-policy","tags":[],"interval":"5m","enabled":true,"revision":2,"description":"T1078-attach-role-trust-policy","risk_score":21,"severity":"low","license":"","output_index":"","meta":{"from":"1m","kibana_siem_app_url":"http://localhost:5601/app/security"},"author":[],"false_positives":[],"from":"now-360s","rule_id":"632ef3bf-577f-4e19-a160-10699ecf1dca","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"threshold","language":"kuery","data_view_id":"security-solution-default","query":"","filters":[{"meta":{"disabled":false,"negate":false,"alias":null,"index":"security-solution-default","key":"result.userIdentity.type","field":"result.userIdentity.type","params":{"query":"IAMUser"},"type":"phrase"},"query":{"match_phrase":{"result.userIdentity.type":"IAMUser"}},"$state":{"store":"appState"}}],"threshold":{"field":["result.userName"],"value":2,"cardinality":[{"field":"result.responseElements.accessKey.accessKeyId","value":2}]},"actions":[]}
{"exported_count":1,"exported_rules_count":1,"missing_rules":[],"missing_rules_count":0,"exported_exception_list_count":0,"exported_exception_list_item_count":0,"missing_exception_list_item_count":0,"missing_exception_list_items":[],"missing_exception_lists":[],"missing_exception_lists_count":0,"exported_action_connector_count":0,"missing_action_connection_count":0,"missing_action_connections":[],"excluded_action_connection_count":0,"excluded_action_connections":[]}
