{
    "id": "8eedbf6a-8def-4555-9d3b-025558a3d129",
    "updated_at": "2024-11-17T10:58:53.433Z",
    "updated_by": "elastic",
    "created_at": "2024-11-17T09:10:03.470Z",
    "created_by": "elastic",
    "name": "A04-T1078-attach-role-trust-policy",
    "tags": [],
    "interval": "5m",
    "enabled": true,
    "revision": 1,
    "description": "T1078-attach-role-trust-policy",
    "risk_score": 21,
    "severity": "low",
    "license": "",
    "output_index": "",
    "meta": {
        "from": "1m",
        "kibana_siem_app_url": "http://localhost:5601/app/security"
    },
    "author": [],
    "false_positives": [],
    "from": "now-360s",
    "rule_id": "632ef3bf-577f-4e19-a160-10699ecf1dca",
    "max_signals": 100,
    "risk_score_mapping": [],
    "severity_mapping": [],
    "threat": [],
    "to": "now",
    "references": [],
    "version": 1,
    "exceptions_list": [],
    "immutable": false,
    "rule_source": {
        "type": "internal"
    },
    "related_integrations": [],
    "required_fields": [],
    "setup": "",
    "type": "threshold",
    "language": "kuery",
    "data_view_id": "827f3f36-f5c4-4ce5-8267-975963f80654",
    "query": "eventName: \"CreateAccessKey\" and responseElements.accessKey.status: \"Active\"\n",
    "filters": [],
    "threshold": {
        "field": [
            "user.name.keyword"
        ],
        "value": 10,
        "cardinality": [
            {
                "field": "@timestamp",
                "value": 1
            }
        ]
    },
    "actions": []
}
{
    "exported_count": 1,
    "exported_rules_count": 1,
    "missing_rules": [],
    "missing_rules_count": 0,
    "exported_exception_list_count": 0,
    "exported_exception_list_item_count": 0,
    "missing_exception_list_item_count": 0,
    "missing_exception_list_items": [],
    "missing_exception_lists": [],
    "missing_exception_lists_count": 0,
    "exported_action_connector_count": 0,
    "missing_action_connection_count": 0,
    "missing_action_connections": [],
    "excluded_action_connection_count": 0,
    "excluded_action_connections": []
}