{"id":"ae70b753-e669-4fca-a311-3248107028bf","updated_at":"2024-11-19T14:39:57.150Z","updated_by":"elastic","created_at":"2024-11-19T14:39:57.150Z","created_by":"elastic","name":"A07-T1110.001-Brute-Force","tags":[],"interval":"5m","enabled":true,"revision":0,"description":"T1110.001-Brute-Force","risk_score":21,"severity":"low","license":"","output_index":"","meta":{"from":"1m","kibana_siem_app_url":"http://localhost:5601/app/security"},"author":[],"false_positives":[],"from":"now-360s","rule_id":"122049b5-b85d-4ad8-a3b0-1a6f60e1a65c","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"threshold","language":"kuery","data_view_id":"security-solution-default","query":"","filters":[{"meta":{"type":"combined","relation":"AND","params":[{"query":{"match_phrase":{"category":"SignInLogs"}},"meta":{"negate":false,"index":"security-solution-default","key":"category","field":"category","params":{"query":"SignInLogs"},"type":"phrase","disabled":false,"alias":null}},{"meta":{"negate":false,"index":"security-solution-default","key":"operationName","field":"operationName","params":{"query":"Sign-in activity"},"type":"phrase","disabled":false,"alias":null},"query":{"match_phrase":{"operationName":"Sign-in activity"}}},{"meta":{"disabled":false,"negate":false,"alias":null,"index":"security-solution-default","key":"properties.flaggedForReview","field":"properties.flaggedForReview","params":{"query":false},"type":"phrase"},"$state":{"store":"appState"},"query":{"match_phrase":{"properties.flaggedForReview":false}}},{"meta":{"disabled":false,"negate":false,"alias":null,"index":"security-solution-default","key":"properties.isTenantRestricted","field":"properties.isTenantRestricted","params":{"query":false},"type":"phrase"},"$state":{"store":"appState"},"query":{"match_phrase":{"properties.isTenantRestricted":false}}}],"index":"security-solution-default","disabled":false,"negate":false,"alias":null},"query":{},"$state":{"store":"appState"}}],"threshold":{"field":["callerIpAddress","properties.status.failureReason","properties.userId"],"value":10,"cardinality":[]},"actions":[]}
{"exported_count":1,"exported_rules_count":1,"missing_rules":[],"missing_rules_count":0,"exported_exception_list_count":0,"exported_exception_list_item_count":0,"missing_exception_list_item_count":0,"missing_exception_list_items":[],"missing_exception_lists":[],"missing_exception_lists_count":0,"exported_action_connector_count":0,"missing_action_connection_count":0,"missing_action_connections":[],"excluded_action_connection_count":0,"excluded_action_connections":[]}
