{"id":"806e73c0-ff90-4fb2-9b5b-7feaf332f090","updated_at":"2024-11-19T18:10:10.610Z","updated_by":"elastic","created_at":"2024-11-19T15:52:31.601Z","created_by":"elastic","name":"A09","tags":[],"interval":"5m","enabled":false,"revision":1,"description":"adadadad","risk_score":21,"severity":"low","license":"","output_index":"","meta":{"from":"1m","kibana_siem_app_url":"http://localhost:5601/app/security"},"author":[],"false_positives":[],"from":"now-360s","rule_id":"ae4d379b-87ac-4813-a7f7-e3f69ce372d4","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","data_view_id":"security-solution-default","query":"","filters":[{"meta":{"type":"combined","relation":"AND","params":[{"$state":{"store":"appState"},"meta":{"type":"combined","relation":"OR","params":[{"query":{"match_phrase":{"EventID":"10"}},"meta":{"negate":false,"index":"security-solution-default","key":"EventID","field":"EventID","params":{"query":"10"},"type":"phrase","disabled":false,"alias":null}},{"meta":{"negate":false,"index":"security-solution-default","key":"EventID","field":"EventID","params":{"query":"7036"},"type":"phrase","disabled":false,"alias":null},"query":{"match_phrase":{"EventID":"7036"}}}],"index":"security-solution-default","disabled":false,"negate":false,"alias":null}},{"$state":{"store":"appState"},"meta":{"type":"combined","relation":"OR","params":[{"query":{"match_phrase":{"SourceProcessId":"588"}},"meta":{"negate":false,"index":"security-solution-default","key":"SourceProcessId","field":"SourceProcessId","params":{"query":"588"},"type":"phrase","disabled":false,"alias":null}},{"meta":{"negate":false,"index":"security-solution-default","key":"SourceProcessId","field":"SourceProcessId","params":{"query":"856"},"type":"phrase","disabled":false,"alias":null},"query":{"match_phrase":{"SourceProcessId":"856"}}},{"query":{"match_phrase":{"SourceProcessId":"848"}},"meta":{"negate":false,"index":"security-solution-default","key":"SourceProcessId","field":"SourceProcessId","params":{"query":"848"},"type":"phrase","disabled":false,"alias":null}}],"index":"security-solution-default","disabled":false,"negate":false,"alias":null}}],"index":"security-solution-default","disabled":false,"negate":false,"alias":null},"query":{},"$state":{"store":"appState"}}],"actions":[]}
{"exported_count":1,"exported_rules_count":1,"missing_rules":[],"missing_rules_count":0,"exported_exception_list_count":0,"exported_exception_list_item_count":0,"missing_exception_list_item_count":0,"missing_exception_list_items":[],"missing_exception_lists":[],"missing_exception_lists_count":0,"exported_action_connector_count":0,"missing_action_connection_count":0,"missing_action_connections":[],"excluded_action_connection_count":0,"excluded_action_connections":[]}
