{"id":"2290f86d-0426-4c5f-8c38-a8b2c8091943","updated_at":"2024-11-19T16:24:56.451Z","updated_by":"elastic","created_at":"2024-11-19T16:24:56.451Z","created_by":"elastic","name":"A03:2021 T1190 Detection Rule","tags":[],"interval":"5m","enabled":true,"revision":0,"description":"A03:2021 T1190 Detection Rule","risk_score":21,"severity":"low","license":"","output_index":"","meta":{"from":"1m","kibana_siem_app_url":"http://localhost:5601/app/security"},"author":[],"false_positives":[],"from":"now-360s","rule_id":"4344754f-e679-48c5-99db-8c2351852764","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0001","name":"Initial Access","reference":"https://attack.mitre.org/tactics/TA0001"},"technique":[{"id":"T1190","name":"Exploit Public-Facing Application","reference":"https://attack.mitre.org/techniques/T1190","subtechnique":[]}]}],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","data_view_id":"security-solution-default","query":"","filters":[{"meta":{"index":"security-solution-default","type":"custom","disabled":false,"negate":false,"alias":null,"key":"query","value":"{\"bool\":{\"should\":[{\"match_phrase\":{\"A03.message\":\"' OR '1'='1 --\"}},{\"match_phrase\":{\"A03.message\":\"UNION SELECT * FROM users\"}}]}}"},"$state":{"store":"appState"},"query":{"bool":{"should":[{"match_phrase":{"A03.message":"' OR '1'='1 --"}},{"match_phrase":{"A03.message":"UNION SELECT * FROM users"}}]}}}],"actions":[]}
{"exported_count":1,"exported_rules_count":1,"missing_rules":[],"missing_rules_count":0,"exported_exception_list_count":0,"exported_exception_list_item_count":0,"missing_exception_list_item_count":0,"missing_exception_list_items":[],"missing_exception_lists":[],"missing_exception_lists_count":0,"exported_action_connector_count":0,"missing_action_connection_count":0,"missing_action_connections":[],"excluded_action_connection_count":0,"excluded_action_connections":[]}
