{"id":"9234225a-d126-408f-b6da-36f128ed9af4","updated_at":"2024-11-19T17:27:34.354Z","updated_by":"elastic","created_at":"2024-11-19T17:27:34.354Z","created_by":"elastic","name":"A08:2021 T1556 Detection Rule","tags":[],"interval":"5m","enabled":true,"revision":0,"description":"A08:2021 T1556 Detection Rule","risk_score":21,"severity":"low","license":"","output_index":"","meta":{"from":"1m","kibana_siem_app_url":"http://localhost:5601/app/security"},"author":[],"false_positives":[],"from":"now-360s","rule_id":"e4f44d7d-8f14-4104-9b10-63a445ecc774","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0005","name":"Defense Evasion","reference":"https://attack.mitre.org/tactics/TA0005"},"technique":[{"id":"T1556","name":"Modify Authentication Process","reference":"https://attack.mitre.org/techniques/T1556","subtechnique":[{"id":"T1556.006","name":"Multi-Factor Authentication","reference":"https://attack.mitre.org/techniques/T1556/006"}]}]}],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"threshold","language":"kuery","data_view_id":"security-solution-default","query":"","filters":[{"$state":{"store":"appState"},"meta":{"type":"combined","relation":"OR","params":[{"query":{"match_phrase":{"ExtendedProperties.Value":"Login:login"}},"meta":{"negate":false,"index":"security-solution-default","key":"ExtendedProperties.Value","field":"ExtendedProperties.Value","params":{"query":"Login:login"},"type":"phrase","disabled":false,"alias":null}},{"meta":{"negate":false,"index":"security-solution-default","key":"Operation","field":"Operation","params":{"query":"Change user password."},"type":"phrase","disabled":false,"alias":null},"query":{"match_phrase":{"Operation":"Change user password."}}}],"index":"security-solution-default","disabled":false,"negate":false,"alias":null},"query":{}}],"threshold":{"field":[],"value":3,"cardinality":[]},"actions":[]}
{"exported_count":1,"exported_rules_count":1,"missing_rules":[],"missing_rules_count":0,"exported_exception_list_count":0,"exported_exception_list_item_count":0,"missing_exception_list_item_count":0,"missing_exception_list_items":[],"missing_exception_lists":[],"missing_exception_lists_count":0,"exported_action_connector_count":0,"missing_action_connection_count":0,"missing_action_connections":[],"excluded_action_connection_count":0,"excluded_action_connections":[]}
