{"id":"57d237fb-78a0-4b70-ad11-58ea5c5fe64f","updated_at":"2024-11-21T10:24:46.050Z","updated_by":"elastic","created_at":"2024-11-21T10:24:46.050Z","created_by":"elastic","name":"A02:2021 T1003.004 Detection Rule","tags":[],"interval":"5m","enabled":true,"revision":0,"description":"A02:2021 T1003.004 Detection Rule","risk_score":21,"severity":"low","license":"","output_index":"","meta":{"from":"1m","kibana_siem_app_url":"http://localhost:5601/app/security"},"author":[],"false_positives":[],"from":"now-360s","rule_id":"27b82a36-ef52-4d24-bbe3-ddc7b33eccc4","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["apm-*-transaction*","auditbeat-*","endgame-*","filebeat-*","logs-*","packetbeat-*","traces-apm*","winlogbeat-*","-*elastic-cloud-logs-*"],"query":"","filters":[{"meta":{"type":"combined","relation":"AND","params":[{"$state":{"store":"appState"},"meta":{"type":"combined","relation":"OR","params":[{"query":{"match_phrase":{"NoLMHash.EventData.TargetObject":"HKLM\\System\\CurrentControlSet\\Control\\Lsa\\DisableRestrictedAdmin"}},"meta":{"negate":false,"index":"apm-*-transaction*,auditbeat-*,endgame-*,filebeat-*,logs-*,packetbeat-*,traces-apm*,winlogbeat-*,-*elastic-cloud-logs-*","key":"NoLMHash.EventData.TargetObject","field":"NoLMHash.EventData.TargetObject","params":{"query":"HKLM\\System\\CurrentControlSet\\Control\\Lsa\\DisableRestrictedAdmin"},"type":"phrase","disabled":false,"alias":null}},{"meta":{"negate":false,"index":"apm-*-transaction*,auditbeat-*,endgame-*,filebeat-*,logs-*,packetbeat-*,traces-apm*,winlogbeat-*,-*elastic-cloud-logs-*","key":"NoLMHash.EventData.TargetObject","field":"NoLMHash.EventData.TargetObject","params":{"query":"HKLM\\System\\CurrentControlSet\\Control\\Lsa\\NoLMHash"},"type":"phrase","disabled":false,"alias":null},"query":{"match_phrase":{"NoLMHash.EventData.TargetObject":"HKLM\\System\\CurrentControlSet\\Control\\Lsa\\NoLMHash"}}}],"index":"apm-*-transaction*,auditbeat-*,endgame-*,filebeat-*,logs-*,packetbeat-*,traces-apm*,winlogbeat-*,-*elastic-cloud-logs-*","disabled":false,"negate":false,"alias":null}},{"query":{"match_phrase":{"NoLMHash.EventData.Details":"DWORD (0x00000000)"}},"meta":{"negate":false,"index":"apm-*-transaction*,auditbeat-*,endgame-*,filebeat-*,logs-*,packetbeat-*,traces-apm*,winlogbeat-*,-*elastic-cloud-logs-*","key":"NoLMHash.EventData.Details","field":"NoLMHash.EventData.Details","params":{"query":"DWORD (0x00000000)"},"type":"phrase","disabled":false,"alias":null}}],"index":"apm-*-transaction*,auditbeat-*,endgame-*,filebeat-*,logs-*,packetbeat-*,traces-apm*,winlogbeat-*,-*elastic-cloud-logs-*","disabled":false,"negate":false,"alias":null},"query":{},"$state":{"store":"appState"}}],"actions":[]}
{"exported_count":1,"exported_rules_count":1,"missing_rules":[],"missing_rules_count":0,"exported_exception_list_count":0,"exported_exception_list_item_count":0,"missing_exception_list_item_count":0,"missing_exception_list_items":[],"missing_exception_lists":[],"missing_exception_lists_count":0,"exported_action_connector_count":0,"missing_action_connection_count":0,"missing_action_connections":[],"excluded_action_connection_count":0,"excluded_action_connections":[]}
