{
    "id": "e93f4c82-25e5-4309-9478-cb697f44c3e3",
    "updated_at": "2024-11-17T10:56:22.087Z",
    "updated_by": "elastic",
    "created_at": "2024-11-17T10:56:22.087Z",
    "created_by": "elastic",
    "name": "A06-T1190-Java-attack",
    "tags": [],
    "interval": "5m",
    "enabled": true,
    "revision": 0,
    "description": "T1190-Java-attack",
    "risk_score": 21,
    "severity": "low",
    "license": "",
    "output_index": "",
    "meta": {
        "from": "1m",
        "kibana_siem_app_url": "http://localhost:5601/app/security"
    },
    "author": [],
    "false_positives": [],
    "from": "now-360s",
    "rule_id": "fe72f210-6f5b-47f7-a5ad-fe26df12ec6a",
    "max_signals": 100,
    "risk_score_mapping": [],
    "severity_mapping": [],
    "threat": [],
    "to": "now",
    "references": [],
    "version": 1,
    "exceptions_list": [],
    "immutable": false,
    "rule_source": {
        "type": "internal"
    },
    "related_integrations": [],
    "required_fields": [],
    "setup": "",
    "type": "query",
    "language": "kuery",
    "data_view_id": "827f3f36-f5c4-4ce5-8267-975963f80654",
    "query": "http.request.method: \"GET\" AND \nhttp.request.user_agent: \"Java/1.8.0_181\" AND \nhttp.request.uri.path: \"*.class\"\n",
    "filters": [],
    "actions": []
}
{
    "exported_count": 1,
    "exported_rules_count": 1,
    "missing_rules": [],
    "missing_rules_count": 0,
    "exported_exception_list_count": 0,
    "exported_exception_list_item_count": 0,
    "missing_exception_list_item_count": 0,
    "missing_exception_list_items": [],
    "missing_exception_lists": [],
    "missing_exception_lists_count": 0,
    "exported_action_connector_count": 0,
    "missing_action_connection_count": 0,
    "missing_action_connections": [],
    "excluded_action_connection_count": 0,
    "excluded_action_connections": []
}